project/app/views/collections/info.html.erb

    <% i = 1 %>
    <% current_user.collections.each do |item| %>
---
SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = ?  [["user_id", 2]]