project/app/views/collections/info.html.erb

    <% i = 1 %>
    <% current_user.carts.each do |item| %>
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 2]]