project/app/controllers/carts_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("product_id", "user_id", "num", "datetime", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["product_id", 1], ["user_id", 2], ["num", 1], ["datetime", "2000-01-01 08:40:14.002389"], ["created_at", "2020-12-30 08:40:14.003056"], ["updated_at", "2020-12-30 08:40:14.003056"]]
---
  def create
    @product = Product.find(params[:product_id])
    @cart = Cart.new(cart_params)
    @cart.product = @product
    @cart.user = current_user
    @cart.datetime = Time.new

    respond_to do |format|
      if @cart.save

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 10]]
---
  def destroy
    @cart.destroy