project/app/controllers/collections_controller.rb

  def index
    @collections = Collection.all
---
SELECT "collections".* FROM "collections"

  def create
    @product = Product.find(params[:product_id])
    @collection = Collection.new
    @collection.product = @product
    @collection.user = current_user

    respond_to do |format|
      if @collection.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "collections" ("product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["user_id", 2], ["created_at", "2020-12-30 11:10:18.972165"], ["updated_at", "2020-12-30 11:10:18.972165"]]

  def destroy
    @collection.destroy
---
DELETE FROM "collections" WHERE "collections"."id" = ?  [["id", 1]]

    def set_collection
      @collection = Collection.find(params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]