project/app/controllers/orders_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 2]]
INSERT INTO "orders" ("user_id", "name", "address", "tele", "time", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @order = Order.new(order_params)
    @order.user = current_user
    @order.time = Time.now
    @total = 0
    current_user.carts.each do |item|
      @total = @total + item.num*item.product.price
    end
    @order.total = @total

    respond_to do |format|
      if @order.save