project/app/controllers/products_controller.rb

  def info
    @product = Product.find( params[:id] )
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "price", "sale", "path", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "坚果"], ["description", "零食"], ["price", 10.0], ["sale", 999], ["path", "/assets/nuts.jpeg"], ["created_at", "2020-12-30 09:09:44.891006"], ["updated_at", "2020-12-30 09:09:44.891006"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "path" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["path", "/assets/cola.png"], ["updated_at", "2020-12-30 06:03:37.643191"], ["id", 1]]