project/app/views/carts/info.html.erb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 2]]
---
    <% i = 1 %>
    <% current_user.carts.each do |item| %>