project/app/views/carts/jiesuan.html.erb

<% total = 0 %>
<% current_user.carts.each do |item| %>
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 2]]